#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.module.memorystore.google_redis_instance.default will be created
  + resource "google_redis_instance" "default" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = true
      + auth_string              = (sensitive value)
      + authorized_network       = (known after apply)
      + connect_mode             = "DIRECT_PEERING"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + labels                   = {
          + "environment" = "cq-provider-gcp"
        }
      + location_id              = (known after apply)
      + memory_size_gb           = 1
      + name                     = "cq-memorystore"
      + nodes                    = (known after apply)
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = "cq-provider-gcp"
      + read_endpoint            = (known after apply)
      + read_endpoint_port       = (known after apply)
      + read_replicas_mode       = (known after apply)
      + redis_version            = (known after apply)
      + region                   = "us-east1"
      + replica_count            = (known after apply)
      + reserved_ip_range        = (known after apply)
      + secondary_ip_range       = (known after apply)
      + server_ca_certs          = (known after apply)
      + tier                     = "BASIC"
      + transit_encryption_mode  = "SERVER_AUTHENTICATION"
    }

  # module.test.module.memorystore.module.enable_apis.google_project_service.project_services["redis.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "cq-provider-gcp"
      + service                    = "redis.googleapis.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @candiduslynx, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*